[
  {
    "id": 1,
    "name": "Bench Press",
    "muscle_group": "Chest",
    "description": "A compound exercise that targets the chest, shoulders, and triceps by pressing a barbell away from the chest while lying on a bench."
  },
  {
    "id": 2,
    "name": "Squat",
    "muscle_group": "Legs",
    "description": "A lower body exercise that primarily targets the quadriceps, hamstrings, and glutes by bending the knees and hips to lower the body, then returning to standing."
  },
  {
    "id": 3,
    "name": "Deadlift",
    "muscle_group": "Back",
    "description": "A compound movement that works the back, glutes, and hamstrings by lifting a barbell from the ground to hip level."
  },
  {
    "id": 4,
    "name": "Shoulder Press",
    "muscle_group": "Shoulders",
    "description": "An upper body exercise that targets the deltoids by pressing a weight overhead from shoulder height."
  },
  {
    "id": 5,
    "name": "Pull-Up",
    "muscle_group": "Back",
    "description": "A bodyweight exercise that targets the upper back and biceps by pulling the body upward while hanging from a bar."
  },
  {
    "id": 6,
    "name": "Bicep Curl",
    "muscle_group": "Arms",
    "description": "An isolation exercise that targets the biceps by curling a weight toward the shoulder."
  },
  {
    "id": 7,
    "name": "Tricep Dip",
    "muscle_group": "Arms",
    "description": "A bodyweight exercise that targets the triceps by lowering and raising the body using parallel bars or a bench."
  },
  {
    "id": 8,
    "name": "Lunge",
    "muscle_group": "Legs",
    "description": "A lower body exercise that targets the quadriceps, hamstrings, and glutes by stepping forward and lowering the hips."
  },
  {
    "id": 9,
    "name": "Plank",
    "muscle_group": "Core",
    "description": "An isometric core exercise that involves maintaining a push-up position to strengthen the abdominals and lower back."
  },
  {
    "id": 10,
    "name": "Lat Pulldown",
    "muscle_group": "Back",
    "description": "A machine exercise that targets the latissimus dorsi by pulling a bar down toward the chest."
  }
]
